app/controllers/users_controller.rb

INSERT INTO "users" ("name", "last_name", "email", "phone", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    #complete this method
    new_user = User.create(user_params)

UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "12456768089"], ["updated_at", "2018-04-17 17:35:02.323366"], ["id", 5]]
---
  def update
    user=set_user

    user.update(user_params)